#### SolidGeometryOptions Members

---

|  |
| --- |
| SolidGeometryOptions Class   Constructors   Methods   Properties   See Also |

The  SolidGeometryOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SolidGeometryOptions | Creates a new SolidOptions class with solid tag settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SolidGeometryOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | SolidTag | Optional solid tag for the Solid. |

# See Also

SolidGeometryOptions Class

Autodesk.Revit.DB Namespace